import axios from 'axios';

//=============================================================================+
// 전체 회원 리스트
//=============================================================================+
export function getUserDataAll(params) {
    return axios({
        method:"get"
        ,url: ('/api/users')
        ,data: params
    });
}

//=============================================================================+
// 1. 활동 사용자, 2. 휴면 사용자, 3. 탈퇴 사용자 리스트
//=============================================================================+
export function getUserDataStatus(id, params) {
    return axios({
        method:"get"
        ,url: ('/api/users/status/'+id)
        ,data: params
    });
}

//=============================================================================+
// 특정 회원 리스트
//=============================================================================+
export function getUserData(id, params) {
    return axios({
        method:"get"
        ,url: ('/api/users/'+id)
        ,data: params
    });
}

//=============================================================================+
// 특정 회원 정보 업데이트
//=============================================================================+
export function updateUserData(id, params) {
    return axios({
        method:"put"
        ,url: ('/api/users/'+id)
        ,data: params
    });
}
//=============================================================================+
// 특정 회원 정보 업데이트
//=============================================================================+
export function updateUserPassword(id, params) {
    return axios({
        method:"put"
        ,url: ('/api/users/'+id+'/new-pw')
        ,data: params
    });
}

//=============================================================================+
// 특정 회원 삭제
//=============================================================================+
export function deleteUserData(id, params) {
    return axios({
        method:"delete"
        ,url: ('/api/users/'+id)
        ,data: params
    });
}
